# CIA Factbook Querying

In [1]:
%%capture
%load_ext sql
%sql sqlite:///data/factbook.db

In [4]:
%%sql
SELECT *
  FROM sqlite_master
 WHERE type='table';

 * sqlite:///data/factbook.db
Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

In [5]:
%%sql
SELECT *
  FROM facts
 LIMIT 5;

 * sqlite:///data/factbook.db
Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

In [6]:
%%sql
SELECT MIN(population),
       MAX(population),
       MIN(population_growth),
       MAX(population_growth)
  FROM facts;

 * sqlite:///data/factbook.db
Done.

[(0, 7256490011, 0.0, 4.02)]

In [8]:
%%sql
SELECT name
  FROM facts
 WHERE population = (SELECT MIN(population)
                       FROM facts);

 * sqlite:///data/factbook.db
Done.

[('Antarctica',)]

In [9]:
%%sql
SELECT name
  FROM facts
 WHERE population = (SELECT MAX(population)
                       FROM facts);

 * sqlite:///data/factbook.db
Done.

[('World',)]

In [12]:
%%sql
SELECT MIN(population),
       MAX(population),
       MIN(population_growth),
       MAX(population_growth)
  FROM facts
 WHERE name NOT IN ('World', 'Antarctica');

 * sqlite:///data/factbook.db
Done.

[(48, 1367485388, 0.0, 4.02)]

In [15]:
%%sql
SELECT ROUND(AVG(population), 3) AS 'Average Population',
       ROUND(AVG(area), 3) AS 'Average Area'
  FROM facts
 WHERE name NOT IN ('World', 'Antarctica');

 * sqlite:///data/factbook.db
Done.

[(32377011.013, 555093.546)]

In [19]:
%%sql
SELECT name
  FROM facts
 WHERE population > (SELECT AVG(population)
                       FROM facts
                      WHERE name NOT IN ('World', 'Antarctica'))
   AND area < (SELECT AVG(area)
                 FROM facts
                WHERE name NOT IN ('World', 'Antarctica'));

 * sqlite:///data/factbook.db
Done.

[('Bangladesh',),
 ('Germany',),
 ('Iraq',),
 ('Italy',),
 ('Japan',),
 ('Korea, South',),
 ('Morocco',),
 ('Philippines',),
 ('Poland',),
 ('Spain',),
 ('Thailand',),
 ('Uganda',),
 ('United Kingdom',),
 ('Vietnam',)]